zpq001/mdr32f9q-ps200w/src/converter.c
//---------------------------------------------//
//	Main converter task
//	
//---------------------------------------------//
void vTaskConverter(void *pvParameters) 
{
	converter_message_t msg;
	
	uint8_t err_code;
	uint8_t res;
	
	
	// Initialize
	xQueueConverter = xQueueCreate( 5, sizeof( converter_message_t ) );		// Queue can contain 5 elements of type converter_message_t
	if( xQueueConverter == 0 )
	{
		// Queue was not created and must not be used.
		while(1);
	}
	
	// Wait until task is started by dispatcher		
	vTaskSuspend(0);			
	
	xQueueReset(xQueueConverter);
	while(1)
	{

		xQueueReceive(xQueueConverter, &msg, portMAX_DELAY);


		switch(msg.type)
		{
			//=========================================================================//
			// Setting voltage
			case CONVERTER_SET_VOLTAGE:
				if (Converter_ValidateChannel(&msg.voltage_setting.channel))
				{
					res = Converter_SetVoltage(msg.voltage_setting.channel, msg.voltage_setting.value, &err_code);
					// Apply new setting to hardware
					if (res & VOLTAGE_SETTING_APPLIED)
					{
						// CHECKME: charge state
						if (msg.voltage_setting.channel == converter_state.channel->CHANNEL)
						{
							SetVoltageDAC(converter_state.channel->voltage.setting);
						}
					}
					// Send notification to GUI
					gui_msg.type = GUI_TASK_UPDATE_CONVERTER_STATE;
					gui_msg.converter_event.spec = VOLTAGE_SETTING_CHANGED;
					gui_msg.converter_event.channel = msg.voltage_setting.channel;
					xQueueSendToBack(xQueueGUI, &gui_msg, 0);

					// Sound feedback
					SoundEvent_OnSettingChanged(err_code);
				}
				else
				{
					// Wrong argument (channel)
				}
				break;
			//=========================================================================//
			// Setting voltage limit
			case CONVERTER_SET_VOLTAGE_LIMIT:
				if (Converter_ValidateChannel(&msg.voltage_limit_setting.channel) && Converter_ValidateLimit(msg.voltage_limit_setting.type))
				{
					res = Converter_SetVoltageLimit(msg.voltage_limit_setting.channel, msg.voltage_limit_setting.type, 
										msg.voltage_limit_setting.value, msg.voltage_limit_setting.enable, &err_code);
					// Apply new setting to hardware
					if (res & VOLTAGE_SETTING_APPLIED)
					{
						// CHECKME: charge state
						if (msg.voltage_limit_setting.channel == converter_state.channel->CHANNEL)
						{
							SetVoltageDAC(converter_state.channel->voltage.setting);
						}
					}
					// Send notification to GUI
					gui_msg.type = GUI_TASK_UPDATE_CONVERTER_STATE;
					gui_msg.converter_event.spec = VOLTAGE_LIMIT_CHANGED | VOLTAGE_SETTING_CHANGED;
					gui_msg.converter_event.channel = msg.voltage_limit_setting.channel;
					gui_msg.converter_event.type = msg.voltage_limit_setting.type;
					xQueueSendToBack(xQueueGUI, &gui_msg, 0);
					
					// Sound feedback
					SoundEvent_OnSettingChanged(err_code);
				}
				else
				{
					// Wrong argument (channel or limit type)
				}
				break;
			//=========================================================================//
			// Setting current
			case CONVERTER_SET_CURRENT:
				if (Converter_ValidateChannel(&msg.current_setting.channel) && Converter_ValidateCurrentRange(&msg.current_setting.range))
				{
					res = Converter_SetCurrent(msg.current_setting.channel, msg.current_setting.range, msg.current_setting.value, &err_code);
					// Apply new setting to hardware
					if (res & CURRENT_SETTING_APPLIED)
					{
						// CHECKME: charge state
						if ((msg.current_setting.channel == converter_state.channel->CHANNEL) && 
							(msg.current_setting.range == converter_state.channel->current->RANGE))
						{
							SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
						}
					}
					// Send notification to GUI
					gui_msg.type = GUI_TASK_UPDATE_CONVERTER_STATE;
					gui_msg.converter_event.spec = CURRENT_SETTING_CHANGED;
					gui_msg.converter_event.channel = msg.current_setting.channel;
					gui_msg.converter_event.current_range = msg.current_setting.range;
					xQueueSendToBack(xQueueGUI, &gui_msg, 0);
				
					// Sound feedback
					SoundEvent_OnSettingChanged(err_code);
				}
				else
				{
					// Wrong argument (channel or range)
				}
				break;
			//=========================================================================//
			// Setting current limit
			case CONVERTER_SET_CURRENT_LIMIT:
				if (Converter_ValidateChannel(&msg.current_limit_setting.channel) && Converter_ValidateCurrentRange(&msg.current_limit_setting.range) &&
					Converter_ValidateLimit(msg.current_limit_setting.type))
				{
					res = Converter_SetCurrentLimit(msg.current_limit_setting.channel, msg.current_limit_setting.range, msg.current_limit_setting.type, 
										msg.current_limit_setting.value, msg.current_limit_setting.enable, &err_code);
					if (res & CURRENT_SETTING_APPLIED)
					{
						// Apply new setting to hardware
						// CHECKME: charge state
						if ((msg.current_limit_setting.channel == converter_state.channel->CHANNEL) && 
							(msg.current_setting.range == converter_state.channel->current->RANGE))
						{
							SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
						}
					}
					// Send notification to GUI
					gui_msg.type = GUI_TASK_UPDATE_CONVERTER_STATE;
					gui_msg.converter_event.spec = CURRENT_LIMIT_CHANGED | CURRENT_SETTING_CHANGED;
					gui_msg.converter_event.channel = msg.current_limit_setting.channel;
					gui_msg.converter_event.type = msg.current_limit_setting.type;
					gui_msg.converter_event.current_range = msg.current_limit_setting.range;
					xQueueSendToBack(xQueueGUI, &gui_msg, 0);
					
					// Sound feedback
					SoundEvent_OnSettingChanged(err_code);
				}
				{
					// Wrong argument (channel or range or limit type)
				}
				break;
			//=========================================================================//
			// Setting channel
			case CONVERTER_SWITCH_CHANNEL:
				// Check arguments
				if (! Converter_ValidateChannel(&msg.channel_setting.new_channel) )
				{
					break;		// Wrong argument (channel)
				}
				if (msg.channel_setting.new_channel == converter_state.channel->CHANNEL)
				{
					SoundEvent_OnGenericError();
					break;		// Trying to set channel that is already selected.
				}
				// Disable converter if enabled
				if (converter_state.state == CONVERTER_STATE_ON)	// TODO: analyze charge state here
				{
					Converter_TurnOff();
					converter_state.state = CONVERTER_STATE_OFF;
				}
				
				// Wait until voltage feedback switching is allowed
				while(Converter_IsReady() == 0) 
					vTaskDelay(1);
				res = Converter_SetFeedBackChannel(msg.channel_setting.new_channel);
				if (res != CONVERTER_CMD_OK)
				{
					// Unexpected error
					Converter_TurnOff();
					SoundEvent_OnGenericError();
					break;
				}
				converter_state.channel = (msg.channel_setting.new_channel == CHANNEL_5V) ? &converter_state.channel_5v : 
											&converter_state.channel_12v;
				while(Converter_IsReady() == 0) 
					vTaskDelay(1);	
				res = Converter_SetCurrentRange(converter_state.channel->current->RANGE);
				if (res != CONVERTER_CMD_OK)
				{
					// Unexpected error
					Converter_TurnOff();
					SoundEvent_OnGenericError();
					break;
				} 
				//SetCurrentRange(converter_state.channel->current->RANGE);
				SetVoltageDAC(converter_state.channel->voltage.setting);
				SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
				SetOutputLoad(converter_state.channel->load_state);

				// Send notification to GUI
				gui_msg.type = GUI_TASK_UPDATE_CONVERTER_STATE;
				gui_msg.converter_event.spec = CHANNEL_CHANGED;
				gui_msg.converter_event.channel = msg.channel_setting.new_channel;
				gui_msg.converter_event.current_range = converter_state.channel->current->RANGE;
				xQueueSendToBack(xQueueGUI, &gui_msg, 0);
				// No sound feeback (a relay is ticking)

				break;
			//=========================================================================//
			// Setting current range
			case CONVERTER_SET_CURRENT_RANGE:
				if (converter_state.state == CONVERTER_STATE_ON)	// TODO: analyze charge state here
				{
					SoundEvent_OnGenericError();
					break;			// Ignore this when converter is enabled
				}
				if (! Converter_ValidateChannel(&msg.current_range_setting.channel) )
				{
					break;			// Wrong argument (channel)
				}	
				if (! Converter_ValidateCurrentRange(&msg.current_range_setting.new_range) )
				{
					break;			// Wrong argument (new_range)
				}
				if ( (msg.current_range_setting.new_range == converter_state.channel->current->RANGE) && 
					 (msg.current_range_setting.channel == converter_state.channel->CHANNEL) )
				{
					SoundEvent_OnSettingChanged(VALUE_BOUND_BY_ABS_MAX);
					break;			// Trying to set current range that is already selected.
				}
				
				// Wait until current feedback switching is allowed
				while(Converter_IsReady() == 0) 
					vTaskDelay(1);	
				
				res = Converter_SetCurrentRange(msg.current_range_setting.new_range);
				if (res != CONVERTER_CMD_OK)
				{
					// Unexpected error
					Converter_TurnOff();
					SoundEvent_OnGenericError();
					break;
				}
				
				converter_state.channel->current = (msg.current_range_setting.new_range == CURRENT_RANGE_LOW) ? &converter_state.channel->current_low_range : 
														&converter_state.channel->current_high_range;
				SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
		
				// Send notification to GUI
				gui_msg.type = GUI_TASK_UPDATE_CONVERTER_STATE;
				gui_msg.converter_event.spec = CURRENT_RANGE_CHANGED;
				gui_msg.converter_event.channel = msg.current_range_setting.channel;
				gui_msg.converter_event.current_range = msg.current_range_setting.new_range;
				xQueueSendToBack(xQueueGUI, &gui_msg, 0);
				// Sound feedback
				//SoundEvent_OnSettingChanged(VALUE_OK);
				break;
			//=========================================================================//
			// Turn ON
			case CONVERTER_TURN_ON:
				if ((converter_state.state == CONVERTER_STATE_OFF) || (converter_state.state == CONVERTER_STATE_OVERLOADED))
				{
					res = Converter_TurnOn();
					if (res == CONVERTER_CMD_OK)
					{
						converter_state.state = CONVERTER_STATE_ON;
					}
					else
					{
						SoundEvent_OnGenericError();
					}
				}
				break;
			//=========================================================================//
			// Turn OFF
			case CONVERTER_TURN_OFF:
				if (converter_state.state == CONVERTER_STATE_ON)
				{
					Converter_TurnOff();
				}
				converter_state.state = CONVERTER_STATE_OFF;	// Reset overloaded state
				break;
			//=========================================================================//
			// Overload
			case CONVERTER_OVERLOADED:
				// Converter has been overloaded and disabled by low-level interrupt-driven routine.
				// Reset that routine FSM flag
				if (Converter_ClearOverloadFlag() == CONVERTER_CMD_OK)
				{
					// OK, flag has been reset.
					SoundEvent_OnOverload();
					converter_state.state = CONVERTER_STATE_OVERLOADED;
				}	
				else
				{
					// Error, we should never get here.
					SoundEvent_OnGenericError();
					// Kind of restore attempt
					Converter_TurnOff();
					converter_state.state = CONVERTER_STATE_OFF;
				}
				break;
			//=========================================================================//
			// Tick
			case CONVERTER_TICK:		// Temporary! Will be special for charging mode
				// ADC task is responsible for sampling and filtering voltage and current
				adc_msg = ADC_GET_ALL_NORMAL;
				xQueueSendToBack(xQueueADC, &adc_msg, 0);
				break;
				
			default:;
		}
	}

}






